In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("./saved/out_nlp_.csv", delimiter="\t")

In [3]:
df1 = pd.read_csv("./saved/n_out_nlp__wikidata.csv", delimiter="\t")

In [4]:
df.tail(5)

,title,type,def words,infobox_name,infobox,categories,wikilinks
14962,The Hobbit,article,fantasy|novel,Infobox book,"name:The Hobbit, or There and Back Again|imag...",The Hobbit|1937 British novels|1937 children's...,J. R. R. Tolkien|High fantasy|Juvenile fantasy...
14963,Tax Freedom Day,article,-,-,-,Tax|Unofficial observances|Libertarian terms,nation|Madsen Pirie|Biteback Publishing|Tax Fo...
14964,Tax,article,compulsory|type|charge|financial,-,-,Taxation by country|3rd-millennium BC establis...,Latin|wikt:en:taxo#Latin|Legal person|Britanni...
14965,Transhumanism,article,philosophical|movement|international,-,-,Transhumanism|1990 introductions|Artificial in...,Transhumance|school of thought|human condition...
14966,TARDIS,article,machine|time|fictional|spacecraft,Infobox fictional artifact,name:TARDIS|image:Tardis BBC Television Center...,Fictional elements introduced in 1963|Bioships...,Doctor Who|BBC|An Unearthly Child|Sydney Newma...

In [5]:
df1.head(5)

  title          label                             type
0   Q15         Africa                            Q5107
1   Q17          Japan           Q3624078|Q112099|Q6256
2   Q18  South America                    Q5107|Q855697
3   Q20         Norway            Q3624078|Q6256|Q41614
4   Q21        England  Q3336843|Q518261|Q1151616|Q6266

### Filtering the dataframe

In [6]:
df = df[df["def words"] != "-"]

In [7]:
n_df1 = df1[df1["label"].isin(df["title"])]
n_df1.head(2)

  title          label                    type
1   Q17          Japan  Q3624078|Q112099|Q6256
2   Q18  South America           Q5107|Q855697

In [8]:
n_df = df[df.title.isin(df1["label"])]
n_df.head(2)

,title,type,def words,infobox_name,infobox,categories,wikilinks
3,A,article,first|letter,-,-,ISO basic Latin letters|Vowel letters,A#Related characters|Latin script|Alphabet|Log...
4,Alabama,article,state,Infobox U.S. state,official_name:State of Alabama|name:Alabama|im...,Alabama|1819 establishments in the United Stat...,Coat of arms of Alabama|Northern flicker|Dixie...

### Getting the categories (or types, eg. human, etc)

In [9]:
cat = set()
for i in df1["type"]:
    cat.update(str(i).split("|"))

In [10]:
categories = df1[df1.title.isin(cat)]

In [11]:
categories

          title               label               type
16           Q3                life            Q937228
18           Q5               human          Q55983715
42          Q44                beer        Q154|Q79529
54          Q58               penis           Q4620674
63          Q68            computer   Q2858615|Q241317
...         ...                 ...                ...
217821  Q241212             pillory    Q933870|Q552345
217883  Q241284           geosphere  Q219858|Q47495022
217913  Q241317  computing platform          Q66747126
218188  Q241625                wish            Q775842
218417  Q241871    tactile alphabet     Q1191702|Q9779

[3263 rows x 3 columns]

In [12]:
df1[df1["title"] == "Q89934"]

        title                 label                                  type
84467  Q89934  community of Belgium  Q838185|Q10864048|Q1048835|Q10553309

# statistics

In [13]:
ia = 0
s_data = {}
for i, row in n_df.iterrows():
    # tmp = categories[categories["title"] == n_df1[n_df1["title"] == row["title"]]["type"]]

    tmp = n_df1[n_df1["label"] == row["title"]]["type"].iloc[0].split("|")
    for t in tmp:
        if t not in s_data.keys():
            s_data[t] = set()
        s_data[t].update(row["def words"].split("|"))

In [14]:
# converting the sets to list to be able to save to json
for s in s_data:
    s_data[s] = list(s_data[s])

In [15]:
import json

json.dump(s_data, open("./saved/teste.json", "w"))

# misc

In [ ]:
df[df.title.str.contains("(?i)scotland")]

In [ ]:
df[df.title.str.contains("(?i)^falmouth")]

In [ ]:
df.loc[6,]["def words"]